/**
 * 存储一些计算网格顶点相关的计算方法
 */

export function initPlaneGeometryVertices(width: number, height: number) {
  return new Float32Array([
    -width / 2,
    height / 2, //左上角
    -width / 2,
    -height / 2, //左下角
    width / 2,
    height / 2, //右上角
    width / 2,
    -height / 2, //右下角
  ]);
}

export function initPlaneGeometryUvs() {
  return new Float32Array([
    // rect uvs
    0.0,
    1.0,
    0.0,
    0.0,
    1.0,
    1.0,
    1.0,
    0.0,
  ]);
}

// 创建一个立方体
//    v6----- v5
//   /|      /|
//  v1------v0|
//  | |     | |
//  | |v7---|-|v4
//  |/      |/
//  v2------v3

export function initBoxGeometryVertices() {
  return new Float32Array([
    // 设置顶点和颜色
    1.0,
    1.0,
    1.0, // v0 front

    -1.0,
    1.0,
    1.0, // v1

    -1.0,
    -1.0,
    1.0, // v2

    1.0,
    -1.0,
    1.0, // v3

    1.0,
    -1.0,
    -1.0, // v4 back

    1.0,
    1.0,
    -1.0, // v5

    -1.0,
    1.0,
    -1.0, // v6

    -1.0,
    -1.0,
    -1.0, // v7

    1.0,
    1.0,
    -1.0, // v8 right

    1.0,
    1.0,
    1.0, // v9

    1.0,
    -1.0,
    1.0, // v10

    1.0,
    -1.0,
    -1.0, // v11

    -1.0,
    1.0,
    -1.0, // v12 top

    -1.0,
    1.0,
    1.0, // v3

    1.0,
    1.0,
    1.0, // v14

    1.0,
    1.0,
    -1.0, // v15

    1.0,
    -1.0,
    1.0, // v16 down

    -1.0,
    -1.0,
    1.0, // v17

    -1.0,
    -1.0,
    -1.0, // v18

    1.0,
    -1.0,
    -1.0, // v19

    -1.0,
    1.0,
    1.0, // v1 left

    -1.0,
    1.0,
    -1.0, // v6

    -1.0,
    -1.0,
    -1.0, // v7

    -1.0,
    -1.0,
    1.0, // v2
  ]);
}

export function initBoxGeometryColors() {
  return new Float32Array([
    // 设置顶点和颜色
    1.0,
    1.0,
    1.0, // v0 front
    1.0,
    1.0,
    1.0, // v1
    1.0,
    1.0,
    1.0, // v2
    1.0,
    1.0,
    1.0, // v3

    0.0,
    1.0,
    1.0, // v4 back
    0.0,
    1.0,
    1.0, // v5
    0.0,
    1.0,
    1.0, // v6
    0.0,
    1.0,
    1.0, // v7

    1.0,
    1.0,
    0.0, // v8 right
    1.0,
    1.0,
    0.0, // v9
    1.0,
    1.0,
    0.0, // v10
    1.0,
    1.0,
    0.0, // v11

    1.0,
    0.0,
    0.0, // v12 top
    1.0,
    0.0,
    0.0, // v3
    1.0,
    0.0,
    0.0, // v14
    1.0,
    0.0,
    0.0, // v15

    0.0,
    1.0,
    0.0, // v16 down
    0.0,
    1.0,
    0.0, // v17
    0.0,
    1.0,
    0.0, // v18
    0.0,
    1.0,
    0.0, // v19

    0.0,
    0.0,
    1.0, // v1 left
    0.0,
    0.0,
    1.0, // v6
    0.0,
    0.0,
    1.0, // v7
    0.0,
    0.0,
    1.0, // v2
  ]);
}

export function initBoxGeometryIndices() {
  return new Uint8Array([
    //顶点索引
    0,
    1,
    2,
    0,
    2,
    3, // 前

    6,
    5,
    4,
    6,
    4,
    7, // 后

    8,
    9,
    10,
    8,
    10,
    11,

    12,
    13,
    14,
    12,
    14,
    15,

    16,
    17,
    18,
    16,
    18,
    19,

    20,
    21,
    22,
    20,
    22,
    23,
  ]);
}
